package com.example.templesp

import android.os.Bundle
import android.widget.ImageView
import android.widget.TextView
import androidx.appcompat.app.AlertDialog
import androidx.cardview.widget.CardView

class TempleInfoActivity : BaseNavActivity() {

    override fun getCurrentIconRes(): Int = R.drawable.ic_temple
    override fun getCurrentNavId(): Int = R.id.navIconTemple

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_temple_info)
        setupPillNav()

        val cardAmulet = findViewById<CardView>(R.id.cardAmulet)
        val cardBuddha = findViewById<CardView>(R.id.cardBuddha)
        val cardGuanYin = findViewById<CardView>(R.id.cardGuanYin)
        val cardTaKhian = findViewById<CardView>(R.id.cardTaKhian)

        cardAmulet.setOnClickListener {
            showDetailsDialog(
                title = "เครื่องรางของขลัง",
                details = "ทความเป็นสุดยอดแห่งวงการ\n" +
                        "ระดับตำนาน: พระปิดตาของหลวงปู่เอี่ยม ได้รับการยกย่องให้เป็น \"หนึ่งในเบญจภาคีพระปิดตาเนื้อผง\" ซึ่งถือเป็นสุดยอดพระปิดตาของประเทศไทย\n" +
                        "\n" +
                        " มวลสารศักดิ์สิทธิ์\n" +
                        "ของดีจากป่า: สร้างจากมวลสารสมุนไพรที่หลวงปู่เอี่ยมเก็บรวบรวมมาด้วยตัวเองในระหว่างที่ท่านออกธุดงค์ นำมาผสมเข้ากับผงเกสรต่างๆ\n" +
                        "\n" +
                        "ผงยันต์วิเศษ: หัวใจสำคัญคือการผสมผงยันต์สำคัญอย่าง \"ผงยันต์มหาโสฬสมงคล\" และ \"ผงยันต์ไตรสรณาคมณ์\" ซึ่งเป็นสูตรยันต์เดียวกับที่ท่านใช้สร้างตะกรุดอันโด่งดัง\n" +
                        "\n" +
                        " พุทธคุณ\n" +
                        "สุดยอดความแคล้วคลาด: พระปิดตาของท่านมีคุณอเนกอนันต์ แต่จะมีความเป็นเลิศและโดดเด่นที่สุดในด้าน การคุ้มครองและป้องกันภัยอันตรายต่างๆ\n" +
                        "\n" +
                        " การสืบทอดวิชา\n" +
                        "สายตรงวัดสะพานสูง: ตำรับการสร้างและศิลปะพระปิดตาสายนี้ ได้รับการสืบทอดต่อมาโดยสุดยอดพระเกจิอาจารย์รุ่นหลังของวัดสะพานสูง คือ หลวงปู่กลิ่น และ หลวงปู่ทองสุข",
                imageResId = R.drawable.pidta
            )
        }

        cardBuddha.setOnClickListener {
            showDetailsDialog(
                title = "พระพุทธรูป",
                details = "ประวัติโดยสังเขป\n" +
                        "นามเดิม: เอี่ยม (ฉายา ปฐมนาม)\n" +
                        "\n" +
                        "ชาตกาล: เกิดเมื่อปีฉลู พ.ศ. 2359 ในสมัยรัชกาลที่ 2 เป็นบุตรของนายนาคและนางจันทร์ พื้นเพเป็นชาว อ.ปากเกร็ด จ.นนทบุรี\n" +
                        "\n" +
                        "การอุปสมบท: บวชเมื่ออายุ 22 ปี ณ วัดบ่อ อ.ปากเกร็ด จากนั้นได้ไปจำพรรษาและศึกษาพระปริยัติธรรมที่วัดกัลยาณมิตรและวัดประยุรวงศาวาส\n" +
                        "\n" +
                        "มรณภาพ: พ.ศ. 2439 สิริอายุรวม 80 ปี บวชได้ 59 พรรษา\n" +
                        "\n" +
                        " การพัฒนาวัดสะพานสูง\n" +
                        "ในปี พ.ศ. 2396 ญาติโยมชาวปากเกร็ดได้นิมนต์ท่านกลับมาเป็นเจ้าอาวาสที่วัดสว่างอารมณ์ ซึ่งปัจจุบันคือวัดสะพานสูง\n" +
                        "\n" +
                        "ท่านเป็นศูนย์รวมจิตใจและได้สร้างวัตถุมงคลเพื่อหาทุนในการก่อสร้างพระอุโบสถ ศาลาการเปรียญ และพระเจดีย์\n" +
                        "\n" +
                        " วัตถุมงคลเลื่องชื่อ\n" +
                        "พระปิดตามหานิยม (เนื้อผงคลุกรัก): จัดเป็นหนึ่งในเบญจภาคีพระปิดตาที่หายากและมีมูลค่าสูง สร้างจากมวลสารและผงวิเศษ มีพุทธคุณเด่นด้านเมตตามหานิยม โชคลาภ และแคล้วคลาด\n" +
                        "\n" +
                        "ตะกรุดมหาโสฬสมงคล: เครื่องรางที่ท่านสร้างเพื่อมอบเป็นของชำร่วยแก่ผู้บริจาคทรัพย์สร้างวัด ซึ่งมีความศักดิ์สิทธิ์และเป็นที่ต้องการอย่างมาก\n" +
                        "\n" +
                        " ความเชื่อและความศรัทธา\n" +
                        "คุณงามความดี: ท่านเป็นพระผู้มีอาคมขลัง มีวาจาศักดิ์สิทธิ์ มักน้อย และถือสันโดษ\n" +
                        "\n" +
                        "คำสั่งเสียสุดท้าย: ก่อนมรณภาพท่านได้กล่าวกับศิษย์ว่า \"ถ้ามีเหตุทุกข์เกิดขึ้นให้ระลึกถึงท่านและเอ่ยชื่อท่านก็แล้วกัน\"\n" +
                        "\n" +
                        "การสักการะแก้บน: ประชาชนนิยมมากราบขอพรและบนบานศาลกล่าวที่รูปหล่อของท่าน โดยมักจะนำ \"กระทงใส่ดอกไม้เจ็ดสี\" มาถวาย",
                imageResId = R.drawable.eaim
            )
        }

        cardGuanYin.setOnClickListener {
            showDetailsDialog(
                title = "ศาลเจ้าแม่กวนอิม",
                details = "ที่ตั้งและบรรยากาศ\n" +
                        "พิกัด: ตั้งอยู่บริเวณริมแม่น้ำ ภายในวัดสะพานสูง อ.ปากเกร็ด จ.นนทบุรี\n" +
                        "\n" +
                        "ความสำคัญ: เป็นอีกหนึ่งจุดสักการะยอดนิยมที่สาธุชนมักแวะเวียนมากราบไหว้ หลังจากขอพรหลวงปู่เอี่ยมเสร็จแล้ว\n" +
                        "\n" +
                        "ภายในศาล: ประดิษฐานรูปปั้นพระแม่กวนอิมปางประทานพรขนาดยืนอยู่ตรงกลาง พร้อมด้วยรูปปั้นเทพบริวาร และเทพเจ้าจีนอยู่ขนาบข้าง\n" +
                        "\n" +
                        " ประวัติและวัตถุมงคลที่เกี่ยวข้อง\n" +
                        "การสร้างวัตถุมงคล: ศาลแห่งนี้มีความผูกพันกับ หลวงพ่อทองสุข (อดีตเจ้าอาวาสวัดสะพานสูง) โดยในช่วงปี พ.ศ. 2518 - 2520 คหบดีชาวจีนได้ร่วมสร้างวัตถุมงคล \"รูปหล่อและเหรียญเจ้าแม่กวนอิม\" ให้หลวงพ่อทองสุขเป็นผู้ปลุกเสก\n" +
                        "\n" +
                        "ความนิยม: ปัจจุบันวัตถุมงคลรุ่นดังกล่าวจัดเป็นของหายากและเป็นที่ต้องการของนักสะสมพระเครื่องสายวัดสะพานสูง\n" +
                        "\n" +
                        "ผู้สร้างแท่นบูชา: จากป้ายจารึกในภาพที่คุณถ่ายมา แท่นบูชาและคาถาสวดนี้จัดสร้างถวายโดย คุณสมเกียรติ ลิมะมาพา\n" +
                        "\n" +
                        " พุทธคุณและการขอพร\n" +
                        "เชื่อกันว่าพระแม่กวนอิมเป็นเทพแห่งความเมตตากรุณา การมากราบไหว้จะช่วยเสริมสิริมงคลในชีวิต\n" +
                        "\n" +
                        "เรื่องที่นิยมขอพร: ความเมตตามหานิยม, ความสำเร็จในหน้าที่การงานและการทำธุรกิจ, ขอให้แคล้วคลาดปลอดภัย และช่วยปัดเป่าโรคภัยไข้เจ็บ",
                imageResId =R.drawable.im_m
            )
        }

        cardTaKhian.setOnClickListener {
            showDetailsDialog(
                title = "ศาลเจ้าแม่ตะเคียน",
                details = " \n" +
                        " ลักษณะและบรรยากาศของศาล\n" +
                        "ที่ตั้ง: เป็นศาลแบบเปิดโล่งที่ตั้งอยู่ภายใต้เต็นท์สีขาว ภายในบริเวณของวัดสะพานสูง\n" +
                        "\n" +
                        "ศูนย์รวมศรัทธา: สิ่งศักดิ์สิทธิ์หลักคือ ท่อนไม้และตอไม้ตะเคียนโบราณ ขนาดใหญ่ ที่ชาวบ้านเชื่อว่าเป็นที่สถิตของรุกขเทวดาหรือแม่นางตะเคียน โดยมีการนำผ้าหลากสี (ผ้าสามสี/เจ็ดสี) มาผูกพันล้อมรอบไว้จำนวนมากเพื่อแสดงความเคารพ\n" +
                        "\n" +
                        "องค์ประกอบรอบศาล: ด้านหลังท่อนไม้มี \"ศาลเพียงตา\" เรือนไม้ทรงไทยประดิษฐานอยู่ ส่วนด้านหน้าบนโต๊ะหินอ่อนมีรูปปั้นสตรีในชุดไทยโบราณ (นางรำ/ตัวแทนแม่ตะเคียน) ตั้งเรียงรายให้สาธุชนได้กราบไหว้\n" +
                        "\n" +
                        " ความเชื่อและการสักการะ\n" +
                        "พุทธคุณเด่น: ผู้คนมักแวะเวียนมากราบไหว้เพื่อขอโชคลาภ ขอให้การงานราบรื่น การค้าขายรุ่งเรือง และขอความสำเร็จในสิ่งที่ปรารถนา\n" +
                        "\n" +
                        "การถวายของ: จากในภาพ จะเห็นได้ว่านอกจากจะมีการจุดธูปขอพรแล้ว ยังนิยมนำพวงมาลัยดอกไม้สดมาถวาย นำชุดไทยมาแขวนแก้บน รวมถึงสามารถร่วมทำบุญใส่ตู้บริจาคที่ตั้งอยู่ด้านหน้าได้ด้วย\n" +
                        "\n" +
                        " คาถาขอโชคลาภ แม่ตะเคียน วัดสะพานสูง\n" +
                        "(ถอดความจากป้ายอักษรสีขาวพื้นน้ำเงินในภาพ)\n" +
                        "\n" +
                        "(ตั้งนะโม 3 จบ)\n" +
                        "จิตตะ จิตตัง แม่นาง\n" +
                        "ตะเคียน เทวะธิดา\n" +
                        "เมตตัญจะ ปิยังมะมะ\n" +
                        "มหาลาโภ มหาโภคัง\n" +
                        "มหาธะนัง ปูเชมิ\n" +
                        "\n" +
                        "(เมื่อสวดจบ ให้ตั้งจิตอธิษฐานขอความสำเร็จในสิ่งต่างๆ ที่ปรารถนา)",
                imageResId = R.drawable.takain
            )
        }
    }

    private fun showDetailsDialog(title: String, details: String, imageResId: Int) {
        val builder = AlertDialog.Builder(this)
        builder.setTitle(title)

        val inflater = layoutInflater
        val dialogView = inflater.inflate(R.layout.dialog_custom_info, null)

        val imageView = dialogView.findViewById<ImageView>(R.id.dialogImage)
        val textView = dialogView.findViewById<TextView>(R.id.dialogDetails)

        imageView.setImageResource(imageResId)
        textView.text = details

        builder.setView(dialogView)
        builder.setPositiveButton("ปิด") { dialog, _ ->
            dialog.dismiss()
        }

        builder.show()
    }
}